Documents/ПоступлениеУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПоступлениеУслуг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныНоменклатурыПоставщиков</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.УчётЗатрат</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВходящийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатурыПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатурыПоставщиков</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПоступлениеУслуг/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура УслугиНоменклатураПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(СтрокаТЧ.СтатьяЗатрат) Тогда
		СтрокаТЧ.СтатьяЗатрат = ПолучитьСтатьюРасходовПоНоменклатуре(СтрокаТЧ.Номенклатура);
	КонецЕсли;
	Дата = ТекущаяДата();
	СтрокаТЧ.Цена = РаботаСЦенами.ПолучитьЦенуПоКонтрагенту(СтрокаТЧ.Номенклатура, Объект.Поставщик, Дата);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтатьюРасходовПоНоменклатуре(Номенклатура)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.СтатьяЗатрат КАК СтатьяЗатрат
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.Наименование = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура.Наименование);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.СтатьяЗатрат;
КонецФункции

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрТЧ(СтрокаТЧ);
КонецПроцедуры

&НаСервере
Функция ПолучитьЦеныДляОбновления(ТекДата, Поставщик, Ссылка)
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеУслугУслуги.НомерСтроки КАК НомерСтроки,
	               |	ПоступлениеУслугУслуги.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ВТ_Номенклатура
	               |ИЗ
	               |	Документ.ПоступлениеУслуг.Услуги КАК ПоступлениеУслугУслуги
	               |ГДЕ
	               |	ПоступлениеУслугУслуги.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЦеныНоменклатурыПоставщиковСрезПоследних.Цена КАК Цена,
	               |	ВТ_Номенклатура.НомерСтроки КАК НомерСтроки
	               |ИЗ
	               |	ВТ_Номенклатура КАК ВТ_Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыПоставщиков.СрезПоследних(&Период, &Поставщик = Поставщик) КАК ЦеныНоменклатурыПоставщиковСрезПоследних
	               |		ПО ВТ_Номенклатура.Номенклатура = ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура"
					;

	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	Запрос.УстановитьПараметр("Период", ТекДата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	МассивДляВозврата = Новый Массив();
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда;
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивДляВозврата.Добавить(Выборка.НомерСтроки);
			МассивДляВозврата.Добавить(Выборка.Цена);	
		КонецЦикла;
		Возврат МассивДляВозврата;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьЦеныТЧ(Команда)
	//Здесь неявный запрос в цикле
	//Для Каждого Элемент Из Объект.Услуги Цикл
	//	Цена = РаботаСЦенами.ПолучитьЦенуПоКонтрагенту(Элемент.Номенклатура, Объект.Поставщик, Объект.Дата);	
	//	Если Цена = 0 Тогда
	//		Продолжить;	
	//	КонецЕсли;
	//	Элемент.Цена = Цена;
	//КонецЦикла;	
	СтрокаЦена = Новый Массив();
	СтрокаЦена = ПолучитьЦеныДляОбновления(Объект.Дата, Объект.Поставщик, Объект.Ссылка); 
	Счетчик = 0;
	Для Каждого Элемент Из Объект.Услуги Цикл
		Если Элемент.НомерСтроки = СтрокаЦена[Счетчик]
			И СтрокаЦена[Счетчик + 1] <> 0 Тогда
			Элемент.Цена = СтрокаЦена[Счетчик + 1];
			Счетчик = Счетчик + 2;
		КонецЕсли;                            
	КонецЦикла;
КонецПроцедуры
